{
  "generic_quacks": [
    "A quote from Professor Cutler: \n\"Quack quack duck quack quack quack quack rubber duck quack quack. Quack quack duck quack quackity quack  quack  duck  quack  quack.   Quack  quack  duck  quack  quack  quack  quack  rubber  duck  quack  quack. Quack quack duck quack quackity quack quack duck quack quack.\"",
    "The quintessential duck’s quack is the sound of the female mallard. Females often give this call in a series of 2–10 quacks that begin loudly and get softer. When courting, she may give a paired form of this quack. The male does not quack; instead he gives a quieter, rasping, one- or two-noted call. Ducklings make soft, shrill whistles when alarmed.",
    "Males make a rattling noise by rubbing the bill against the flight feathers in a special display that resembles stylized preening. This display is given toward a mate and presumably helps maintain the pair bond.", 
    "Any given duck may have different sounds for courtship songs, fending off an intruder, showing stress or begging for food. The pitch, rhythm, volume, raspiness, breathiness, number of repetitions, and other qualities of the sound can also vary depending on the situation, species, age, and gender of the bird. For example, nestlings generally have quieter, breathier, more urgent vocalizations as they beg for food. On the other hand, an adult duck's alarm call is generally more strident and louder to alert other ducks to a potential threat.",
    "Listening carefully to positively identified ducks, such as the familiar ducks at a local pond. This will help birders learn to better identify those common species and note when other sounds are audible that would indicate unusual visitors.",
    "While it can be tempting to use duck calls as the only identification clue, it can be very challenging to tell different ducks apart by voice alone, and even experienced birders may be fooled by a unique duck sound. As with any bird identification, it is best to use a variety of clues to positively identify the bird, including not only sounds, but also plumage, size, behavior, range, and other characteristics.",
    "One of the hardest things to note about duck sounds is that ducks aren't the only birds that quack. Because ducks have such an array of different sounds in their vocabulary, their voices can sound similar to many other types of birds, including the other members of the Anatidae family, geese, and swans. Cranes, herons, pelicans, cormorants and even some raptors can make similar sounds and could be confused for ducks. In areas with large, vocal duck populations, skilled bird mimics may even incorporate duck-like sounds into their repertoire.",
    "Female domestic ducks (except muscovies) make a loud alarm call \"QUACK!\" when they are startled, hungry, or separated from a member of their group. Drakes (males) can't make this sound at all.  All females have the ability to make this sound, but their inclination to do it seems highly individual.  I have a Khaki Campbell duck who never makes a quack, and we had a crested Rouen last year who would quack with little provocation. Call ducks, mallards and Pekins are known as very vocal breeds, and Muscovies cannot quack, but otherwise I think vocalization varies more on an individual than a breed basis.",
    "All things considered, though, I think a happy flock is a quiet flock.  Ducks are very social creatures, and it helps to have a good, balanced flock.  I've noticed that having a mature (but not too aggressive) drake in the flock helps keep the ducks calm, as does having the right male-to-female ratio (about 1:2-5).  There are distinct gender roles in the flock, and mate bonding is much more important for ducks than chickens.  We had to cull a very aggressive drake last year and it had a considerable affect on his mate and flock. You may not need a male duck to get duck eggs, but having one around may help you get a happy flock.",
    "Socialization with people and neighborhood noise seems to make a big difference.  Our very first ducks were 4-week-old feed-store ducks, but we hatched all the members of our current flock in our own incubator.  The ducks that came from the feed store were always wary of people and much less calm.  Our home-hatched ducks were accustomed to our voices and the sounds of our household since before they hatched.  Our current ducks don't quack at our neighbors, other passers by, kids, bikes, cars, etc.  The one down side of imprinting our ducks like this is that they will quack if they hear my voice but can't see me. If you want ducks that are at ease with you and your household, get day-olds or hatching eggs and socialize them well.",
    "We have never had a problem with our ducks making the alarm call while in their coop. Our coop, like a lot of designs for duck coops, has a low ceiling and fairly small size--more like a dog house on stilts than like a shed.  Wild Mallards don't usually roost, like chickens, but rather find secluded & semi-sheltered places to nest. Once there and comfortable and safe, they don't tend to make much noise. Our ducks are in the coop from dusk until about 8 AM, so we do not get any night-time or early morning nuisance quacks.",
    "Ducks do quack and mine have done it at pretty predictable times for pretty ordinary reasons.  If they are outside the coop and hungry or don't have access to water, they'll quack--but that is pretty easy to prevent.  Sometimes, if they are out of the coop, hear my voice and want to find me, they will quack, which usually happens when I go outside during the day, and sometimes in the summer when I'm inside and the windows are open.  Once I show the ducks where I am, they knock it off. When ducks are \"adolescents\" (around 11 to 16 weeks old) I've noticed that they go through a phase when they are more frequently vocal. At this point it is helpful to give them something extra to do, like play in the sprinkler or a big mud puddle.  It also helps to stagger the ages of the ducks so you don't have a bunch of them going through this phase at the same time. We don't have many hawks or predatory birds in our neighborhood, so this is almost never a cause for quacking here.",
    "Males make a rattling noise by rubbing the bill against the flight feathers in a special display that resembles stylized preening. This display is given toward a mate and presumably helps maintain the pair bond.",
    "The ubiquitous quack is always associated with ducks, but ducks actually make many other vocal and non-vocal sounds. Recognizing the sounds ducks make is essential for birding by ear whenever these wonderful waterfowl are involved.",
    "The familiar \"quack\" attributed to all ducks is usually the female mallard's quacking, though many female dabbling ducks make similar quacking noises. Quacks are not the only sounds in ducks' vocabularies, though. While ducks generally do not sing, they can make a variety of vocalizations.",
    "Any given duck may have different sounds for courtship songs, fending off an intruder, showing stress or begging for food. The pitch, rhythm, volume, raspiness, breathiness, number of repetitions, and other qualities of the sound can also vary depending on the situation, species, age, and gender of the bird. For example, nestlings generally have quieter, breathier, more urgent vocalizations as they beg for food. On the other hand, an adult duck's alarm call is generally more strident and louder to alert other ducks to a potential threat.",
    "Quack",
    "Quack‽‽‽",
    "🦆",
    "🦆🦆🦆🦆🦆",
    "QuAcK", 
    "qUaCk", 
    "Quack implies quack, therefore quack implies quack QUACK, so as you can see quack quack quack\nQuackED",
    "404 Quack Not Found",
    "QUOCK",
    "Quack!",
    "quack, quack?",
    "QUACK",
    "Psyduck",
    "QQQQQUUUUUAAAACCCCKKKKK",
    "QUACK!!!!",
    "q u a c k",
    "Quack? Quack. Quack!",
    "Quackity Quack",
    "Quack Quack, Quackity Quack",
    "Quackity Quackity Quack",
    "1 quack, 2 quack, I quack, you quack",
    "Quack?",
    ":regional_indicator_q: :regional_indicator_u: :regional_indicator_a: :regional_indicator_c: :regional_indicator_k:",
    ":regional_indicator_q:uack",
    ":b:uack",
    "Want to learn more about rubber duck debugging? Check out this wikipedia article <https://en.wikipedia.org/wiki/Rubber_duck_debugging>",
    "https://gph.is/14NuIzL",
    "```  __\n<(o )___\n ( ._> / \n  `---'   ```",
    "```  _      _      _\n>(.)__ <(.)__ =(.)__\n  (___/  (___/  (___/ ```",
    "I have to admit, not even I can help you with every coding problem. Have you tried <https://duck.com> \nIf you need duck help that is beyond my skill there is no better place!",
    "Duck ERROR:\nSegmentation fault (core dumped)",
    "A quacku:\nquack quack quack quack quack\nquack quack quack quack quack quack quack\nquack quack quack quack quack",
    "Roses are red,\nDucks go quack.\nYou come to me\nwhen your code is wack",
    "```python\nimport os\nwhile(os.fork()):\n  print('quack')\n```"
  ],
	"rd_quacks": [
		""
	],
  "rm_quacks": [
		""
	]
}
